"""8. Определить, является ли год, который ввел пользователем, високосным или
невисокосным."""

year = int(input('Введите год: '))

if year % 400 == 0:
    print(f"Год {year} високосный")     # год, номер которого кратен 400, — високосный;
elif year % 100 == 0 and year % 400 != 0:
    print(f"Год {year} невисокосный")   # остальные годы, номер которых кратен 100, — невисокосные;
elif year % 4 == 0:
    print(f"Год {year} високосный")     # остальные годы, номер которых кратен 4, — високосные.
else:
    print(f"Год {year} невисокосный")