'''2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
Объяснить полученный результат.'''

n = 5
m = 6

'''"И" оператор, копирует бит в результат только если бит присутствует
в обоих операндах.'''
print(f"""Побитовое «И» (AND) для {bin(n)} и {bin(m)}: \
{bin(n & m)} ({n & m})""")

'''"ИЛИ" оператор копирует бит, если тот присутствует в хотя бы в одном
операнде.'''
print(f"""Побитовое «ИЛИ» (OR) для {bin(n)} и {bin(m)}: \
{bin(n | m)} ({n | m})""")

'''Побитовый сдвиг вправо. Значение левого операнда "сдвигается" вправо
на количество бит указанных в правом операнде.'''
print(f"""Битовый сдвиг вправо для {bin(n)}: \
{bin(n >> 2)} ({n >> 2})""")

'''Побитовый сдвиг влево. Значение левого операнда "сдвигается" влево
на количество бит указанных в правом операнде.'''
print(f"""Битовый сдвиг влево для {bin(n)}: \
{bin(n << 2)} ({n << 2})""")


